# Задача 2: Найдите сумму цифр 
# трехзначного числа.

# Пример:
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

a = int(input("введите трехзначное число"))
r1 = a%10
r2 = (a%100)//10
r3 = a//100
print(r1+r2+r3, f"({r3} + {r2} + {r1})")